[command]/home/runner/work/_temp/9ec9a220-b3ea-44f3-8809-b2bf5797e2d9/terraform-bin plan -input=false -refresh=false

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # cloudflare_record.caa[0m will be updated in-place
[0m  [33m~[0m[0m resource "cloudflare_record" "caa" {
        id              = "f0ff1c2a96b7c0ec2b0f8773d10e19e9"
        name            = "thetillhoff.de"
        tags            = []
        [90m# (11 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m data {
          [31m-[0m[0m algorithm      = 0 [90m-> null[0m[0m
          [31m-[0m[0m altitude       = 0 [90m-> null[0m[0m
          [31m-[0m[0m digest_type    = 0 [90m-> null[0m[0m
          [31m-[0m[0m flags          = "0" [90m-> null[0m[0m
          [31m-[0m[0m key_tag        = 0 [90m-> null[0m[0m
          [31m-[0m[0m lat_degrees    = 0 [90m-> null[0m[0m
          [31m-[0m[0m lat_minutes    = 0 [90m-> null[0m[0m
          [31m-[0m[0m lat_seconds    = 0 [90m-> null[0m[0m
          [31m-[0m[0m long_degrees   = 0 [90m-> null[0m[0m
          [31m-[0m[0m long_minutes   = 0 [90m-> null[0m[0m
          [31m-[0m[0m long_seconds   = 0 [90m-> null[0m[0m
          [31m-[0m[0m matching_type  = 0 [90m-> null[0m[0m
          [31m-[0m[0m order          = 0 [90m-> null[0m[0m
          [31m-[0m[0m port           = 0 [90m-> null[0m[0m
          [31m-[0m[0m precision_horz = 0 [90m-> null[0m[0m
          [31m-[0m[0m precision_vert = 0 [90m-> null[0m[0m
          [31m-[0m[0m preference     = 0 [90m-> null[0m[0m
          [31m-[0m[0m priority       = 0 [90m-> null[0m[0m
          [31m-[0m[0m protocol       = 0 [90m-> null[0m[0m
          [31m-[0m[0m selector       = 0 [90m-> null[0m[0m
          [31m-[0m[0m size           = 0 [90m-> null[0m[0m
          [31m-[0m[0m tag            = "issue" [90m-> null[0m[0m
          [31m-[0m[0m type           = 0 [90m-> null[0m[0m
          [31m-[0m[0m usage          = 0 [90m-> null[0m[0m
          [31m-[0m[0m value          = "letsencrypt.org" [90m-> null[0m[0m
          [31m-[0m[0m weight         = 0 [90m-> null[0m[0m
        }
    }

[1m  # local_file.ansible_inventory[0m will be created
[0m  [32m+[0m[0m resource "local_file" "ansible_inventory" {
      [32m+[0m[0m content              = <<-EOT
            # This inventory file is managed by Terraform. Do not change manually!
            [kubenodes]
            167.235.25.128
        EOT
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "0777"
      [32m+[0m[0m filename             = "../inventory.ini"
      [32m+[0m[0m id                   = (known after apply)
    }

[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A  [33m~[0m update in-place[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # cloudflare_record.caa[0m will be updated in-place%0A[0m  [33m~[0m[0m resource "cloudflare_record" "caa" {%0A        id              = "f0ff1c2a96b7c0ec2b0f8773d10e19e9"%0A        name            = "thetillhoff.de"%0A        tags            = []%0A        [90m# (11 unchanged attributes hidden)[0m[0m%0A%0A      [31m-[0m[0m data {%0A          [31m-[0m[0m algorithm      = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m altitude       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m digest_type    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m flags          = "0" [90m-> null[0m[0m%0A          [31m-[0m[0m key_tag        = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m lat_degrees    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m lat_minutes    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m lat_seconds    = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m long_degrees   = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m long_minutes   = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m long_seconds   = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m matching_type  = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m order          = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m port           = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m precision_horz = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m precision_vert = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m preference     = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m priority       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m protocol       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m selector       = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m size           = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m tag            = "issue" [90m-> null[0m[0m%0A          [31m-[0m[0m type           = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m usage          = 0 [90m-> null[0m[0m%0A          [31m-[0m[0m value          = "letsencrypt.org" [90m-> null[0m[0m%0A          [31m-[0m[0m weight         = 0 [90m-> null[0m[0m%0A        }%0A    }%0A%0A[1m  # local_file.ansible_inventory[0m will be created%0A[0m  [32m+[0m[0m resource "local_file" "ansible_inventory" {%0A      [32m+[0m[0m content              = <<-EOT%0A            # This inventory file is managed by Terraform. Do not change manually!%0A            [kubenodes]%0A            167.235.25.128%0A        EOT%0A      [32m+[0m[0m content_base64sha256 = (known after apply)%0A      [32m+[0m[0m content_base64sha512 = (known after apply)%0A      [32m+[0m[0m content_md5          = (known after apply)%0A      [32m+[0m[0m content_sha1         = (known after apply)%0A      [32m+[0m[0m content_sha256       = (known after apply)%0A      [32m+[0m[0m content_sha512       = (known after apply)%0A      [32m+[0m[0m directory_permission = "0777"%0A      [32m+[0m[0m file_permission      = "0777"%0A      [32m+[0m[0m filename             = "../inventory.ini"%0A      [32m+[0m[0m id                   = (known after apply)%0A    }%0A%0A[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.%0A[0m[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
